In [1]:
import mysql.connector as conn

In [3]:
mydb = conn.connect(host = "localhost", user = "root", passwd = "mysql")

In [4]:
cursor = mydb.cursor()

In [8]:
cursor.execute('use assim_sql')

In [9]:
cursor.execute('SELECT * FROM worker_table')
cursor.fetchall()

[(1,
  'Mukesh shrestha',
  'Top level',
  230000,
  datetime.datetime(2014, 2, 11, 0, 0)),
 (2,
  'Sabita Malla',
  'Account',
  55000,
  datetime.datetime(2011, 9, 23, 9, 34, 21)),
 (3,
  'Binay Panjiyar',
  'Account',
  41000,
  datetime.datetime(2014, 11, 27, 10, 35, 29)),
 (4, 'Sujan Joshi', 'Cash', 63000, datetime.datetime(2014, 2, 2, 10, 43, 39)),
 (5, 'Ram Shah', 'Driver', 32500, datetime.datetime(2014, 3, 5, 11, 35, 23)),
 (6,
  'Hari Lama',
  'Marketing',
  115300,
  datetime.datetime(2014, 2, 19, 10, 45, 13)),
 (7,
  'Bishal Kumar',
  'Top level',
  215000,
  datetime.datetime(2014, 3, 16, 12, 39, 10)),
 (8,
  'Kavi Bhatari',
  'Top level',
  215000,
  datetime.datetime(2016, 9, 22, 12, 39, 10)),
 (9,
  'Amitabh Bhata',
  'CEO',
  350000,
  datetime.datetime(2016, 9, 22, 11, 23, 17)),
 (10,
  'Vipul Sarma',
  'Marketing',
  123500,
  datetime.datetime(2014, 2, 24, 11, 23, 17)),
 (11,
  'Satish Kumar',
  'Marketing',
  123500,
  datetime.datetime(2013, 3, 22, 11, 23, 17))]

In [7]:
"""Assignment_9"""

'Assignment_9'

In [16]:
"""Q-17. Write an SQL query to show the top n (say 10) records of a table."""

cursor.execute('SELECT * FROM (SELECT Id, First_Name, Department, Salary, ROW_NUMBER() OVER(ORDER BY Id) AS Records FROM worker_table) AS K HAVING Records < 11')
cursor.fetchall()

[(1, 'Mukesh shrestha', 'Top level', 230000, 1),
 (2, 'Sabita Malla', 'Account', 55000, 2),
 (3, 'Binay Panjiyar', 'Account', 41000, 3),
 (4, 'Sujan Joshi', 'Cash', 63000, 4),
 (5, 'Ram Shah', 'Driver', 32500, 5),
 (6, 'Hari Lama', 'Marketing', 115300, 6),
 (7, 'Bishal Kumar', 'Top level', 215000, 7),
 (8, 'Kavi Bhatari', 'Top level', 215000, 8),
 (9, 'Amitabh Bhata', 'CEO', 350000, 9),
 (10, 'Vipul Sarma', 'Marketing', 123500, 10)]

In [17]:
"""Q-18. Write an SQL query to determine the nth (say n=5) highest salary from a table."""

cursor.execute("SELECT * FROM(SELECT Id, First_Name, Department, Salary, ROW_NUMBER() OVER(ORDER BY Salary DESC) AS Highest_Salary FROM worker_table) AS N HAVING Highest_Salary < 6")
cursor.fetchall()

[(9, 'Amitabh Bhata', 'CEO', 350000, 1),
 (1, 'Mukesh shrestha', 'Top level', 230000, 2),
 (7, 'Bishal Kumar', 'Top level', 215000, 3),
 (8, 'Kavi Bhatari', 'Top level', 215000, 4),
 (10, 'Vipul Sarma', 'Marketing', 123500, 5)]